Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateBaluster Property
 Can't create Balusters for given Width and Height.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateBaluster { get; }
Public Shared ReadOnly Property CannotCreateBaluster As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateBaluster {
	FailureDefinitionId^ get ();
}
static member CannotCreateBaluster : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace